### Merge 2 DataFrames

In [1]:
import numpy as np
import pandas as pd

In [2]:
employees=pd.DataFrame({
    'EmployeeID':[1,2,3,4],
    'EmployeeName':['John','Smith','Alice','Bob'],
    'DepartmentName':['HR','IT','Finance','IT']})

salaries=pd.DataFrame({
    'EmployeeID':[3,4,5,6],
    'Salary':[70000,80000,90000,60000],
    'Bonus':[7000,8000,9000,6000]
})

In [4]:
employees

   EmployeeID EmployeeName DepartmentName
0           1         John             HR
1           2        Smith             IT
2           3        Alice        Finance
3           4          Bob             IT

In [7]:
salaries

   EmployeeID  Salary  Bonus
0           3   70000   7000
1           4   80000   8000
2           5   90000   9000
3           6   60000   6000

In [ ]:
pd.merge(employees,salaries,on='EmployeeID',how='inner') # inner join is the default join.

   EmployeeID EmployeeName DepartmentName  Salary  Bonus
0           3        Alice        Finance   70000   7000
1           4          Bob             IT   80000   8000

In [8]:
pd.merge(employees,salaries,on='EmployeeID',how='right') # right join

   EmployeeID EmployeeName DepartmentName  Salary  Bonus
0           3        Alice        Finance   70000   7000
1           4          Bob             IT   80000   8000
2           5          NaN            NaN   90000   9000
3           6          NaN            NaN   60000   6000

In [9]:
pd.merge(employees,salaries,on='EmployeeID',how='left') #left join

   EmployeeID EmployeeName DepartmentName   Salary   Bonus
0           1         John             HR      NaN     NaN
1           2        Smith             IT      NaN     NaN
2           3        Alice        Finance  70000.0  7000.0
3           4          Bob             IT  80000.0  8000.0

### Concatination of 2 data frames

In [10]:
df1=pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2'],
    'C':['C0','C1','C2']
})

df2=pd.DataFrame({
    'A':['A3','A4','A5'],  
    'B':['B3','B4','B5'],
    'C':['C3','C4','C5']
})

In [11]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [12]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [ ]:
pd.concat([df1,df2]) # by default axis=0 i.e row wise concatenation

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [14]:
pd.concat([df1,df2],axis=1) # row wise concatenation

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

### Joining 2 DataFrames

In [15]:
df1=pd.DataFrame({
    'name':['Prakash','Bikash','Akash']
},index=['1','2','3'])

df2=pd.DataFrame({
    'score':[90,80,70]
},index=['2','3','4'])

In [16]:
df1

      name
1  Prakash
2   Bikash
3    Akash

In [17]:
df2

   score
2     90
3     80
4     70

In [21]:
df1.join(df2,how='inner') # outer join

     name  score
2  Bikash     90
3   Akash     80

In [22]:
df1.join(df2,how='outer') # outer join

      name  score
1  Prakash    NaN
2   Bikash   90.0
3    Akash   80.0
4      NaN   70.0